test-plans/ams_apis_test_plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="ams_apis_test_plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <com.tag.jmeter.ext.config.PropertyReader guiclass="TestBeanGUI" testclass="com.tag.jmeter.ext.config.PropertyReader" testname="Property File Reader" enabled="true">
        <stringProp name="propFilePath">..\jmeter.properties</stringProp>
      </com.tag.jmeter.ext.config.PropertyReader>
      <hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Group (run once)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Yats Token" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="grant_type" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">${__P(yats.server.grant_type)}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">grant_type</stringProp>
              </elementProp>
              <elementProp name="client_id" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">${__P(yats.server.client_id)}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">client_id</stringProp>
              </elementProp>
              <elementProp name="client_secret" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">${__P(yats.server.client_secret)}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">client_secret</stringProp>
              </elementProp>
              <elementProp name="scope" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">${__P(yats.server.scope)}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">scope</stringProp>
              </elementProp>
              <elementProp name="tenant" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">${__P(uem.server.tenantuuid)}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">tenant</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(yats.server.url)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(yats.server.port)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(yats.server.protocol)}</stringProp>
          <stringProp name="HTTPSampler.path">${__P(yats.server.token.path)}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">access_token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.access_token</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">no value</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Host</stringProp>
                <stringProp name="Header.value">localhost:29999</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="Set Access Token" enabled="true">
            <stringProp name="BeanShellAssertion.query">${__setProperty(access_token,${access_token})};</stringProp>
            <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
          </BeanShellAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="PubSub notifications in AMS" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(ams.pubsub.notifications.loopcount)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(ams.pubsub.notifications.devices)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ams.pubsub.notifications.rampup)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(ams.pubsub.notifications.totalduration)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="PubSub notification" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;notification_type&quot;: &quot;STATUS_REPORT&quot; ,&#xd;
    &quot;data&quot;: &quot;ewogICJuYW1lIjogImVudGVycHJpc2VzL0xDMDN6dWZ2ZG0vZGV2aWNlcy8zMTFhNDY2YWNmMDRiMDVmIiwKICAibWFuYWdlbWVudE1vZGUiOiAiUFJPRklMRV9PV05FUiIsCiAgInN0YXRlIjogIlBST1ZJU0lPTklORyIsCiAgImVucm9sbG1lbnRUaW1lIjogIjIwMjItMTAtMjBUMTQ6MjA6MjUuMDMyWiIsCiAgImxhc3RTdGF0dXNSZXBvcnRUaW1lIjogIjIwMjItMTAtMjBUMTQ6MjA6MzAuNzYxWiIsCiAgImxhc3RQb2xpY3lTeW5jVGltZSI6ICIyMDIyLTEwLTIwVDE0OjIwOjI4LjUxNVoiLAogICJoYXJkd2FyZUluZm8iOiB7CiAgICAiYnJhbmQiOiAiZ29vZ2xlIiwKICAgICJoYXJkd2FyZSI6ICJ0YWltZW4iLAogICAgImRldmljZUJhc2ViYW5kVmVyc2lvbiI6ICJnODk5OC0wMDAzNC0yMDA2MDUyMTM2IiwKICAgICJtYW51ZmFjdHVyZXIiOiAiR29vZ2xlIiwKICAgICJzZXJpYWxOdW1iZXIiOiAiNzEwS1BVVTAzODMxNTgiLAogICAgIm1vZGVsIjogIlBpeGVsIDIgWEwiCiAgfSwKICAicG9saWN5TmFtZSI6ICJlbnRlcnByaXNlcy9MQzAzenVmdmRtL3BvbGljaWVzLzkxOTg3OWRjLTg3YWEtNGViZC04MjIwLTU5YWQ1MTZlNmQwNiIsCiAgIm1lbW9yeUluZm8iOiB7CiAgICAidG90YWxSYW0iOiAiMzgzOTk1NDk0NCIsCiAgICAidG90YWxJbnRlcm5hbFN0b3JhZ2UiOiAiMjY0MDYzNzk1MiIKICB9LAogICJwb3dlck1hbmFnZW1lbnRFdmVudHMiOiBbewogICAgImV2ZW50VHlwZSI6ICJCT09UX0NPTVBMRVRFRCIsCiAgICAiY3JlYXRlVGltZSI6ICIyMDIyLTEwLTIwVDEyOjM1OjM5LjMzMVoiCiAgfV0sCiAgInVzZXJOYW1lIjogImVudGVycHJpc2VzL0xDMDN6dWZ2ZG0vdXNlcnMvMTE2OTE1NDU0ODA5MDkwMjY3MTUwIiwKICAiZW5yb2xsbWVudFRva2VuTmFtZSI6ICJlbnRlcnByaXNlcy9MQzAzenVmdmRtL2Vucm9sbG1lbnRUb2tlbnMvY0JNY0ZWWkhCTi1RSExzMVZGMnVaWGpDdE83UGJIajZPRW43Nko5dzI3byIsCiAgInByZXZpb3VzRGV2aWNlTmFtZXMiOiBbImVudGVycHJpc2VzL0xDMDN6dWZ2ZG0vZGV2aWNlcy8zYmQyOGFhMWY5MzRjZThmIiwgImVudGVycHJpc2VzL0xDMDN6dWZ2ZG0vZGV2aWNlcy8zNThmNTY3NWQwN2I2NzAyIiwgImVudGVycHJpc2VzL0xDMDN6dWZ2ZG0vZGV2aWNlcy8zMjIzOTU4YjRhYjA2YjdiIl0sCiAgInVzZXIiOiB7CiAgICAiYWNjb3VudElkZW50aWZpZXIiOiAiMTczODYwZGQtYThjYS00YTQzLWIyOWEtYWI2YmJjN2RiNmIzIgogIH0sCiAgInNlY3VyaXR5UG9zdHVyZSI6IHsKICAgICJkZXZpY2VQb3N0dXJlIjogIlNFQ1VSRSIKICB9LAogICJvd25lcnNoaXAiOiAiUEVSU09OQUxMWV9PV05FRCIKfQ==&quot;,&#xd;
    &quot;message_id&quot;: &quot;1054210010873527&quot;,&#xd;
    &quot;time_stamp&quot;: &quot;2020-03-10T20:31:05.719Z&quot;,&#xd;
    &quot;publish_time&quot;: &quot;2020-03-10T20:31:05.719Z&quot;&#xd;
&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(ams.server.url)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(ams.server.port)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(ams.server.protocol)}</stringProp>
          <stringProp name="HTTPSampler.path">/android-management/v1/pubsubnotifications</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
            <stringProp name="throughput">${__P(ams.pubsub.notifications.requests.per.minute)}</stringProp>
            <intProp name="calcMode">3</intProp>
          </ConstantThroughputTimer>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">uem-tenant-uuid</stringProp>
                <stringProp name="Header.value">${__P(uem.server.tenantuuid)}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">X-Correlation-ID</stringProp>
                <stringProp name="Header.value">51126e52-aa49-43ed-8446-cbaa7ac335ce</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">bearer ${__property(access_token)}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Host</stringProp>
                <stringProp name="Header.value">localhost:29999</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">C:\Designs\AMAPI\PubSub API test.csv</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>